Тестовая_база_ERP_14/src/Documents/CRM_Интерес/CRM_Интерес.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CRM_Интерес</name>
  <comment>Интерес</comment>
  <basedOn>Document.CRM_Интерес</basedOn>
  <basedOn>Catalog.Партнеры</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <comment>Автор документа</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВероятностьСделки</name>
    <comment>Вероятность сделки в процентах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Документ основание</comment>
    <type>
      <types>CatalogRef.МаркетинговыеМероприятия</types>
      <types>DocumentRef.CRM_Интерес</types>
      <types>DocumentRef.CRM_РассылкаЭлектронныхПисем</types>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.CRM_Телемаркетинг</types>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>DocumentRef.CRM_Заявка</types>
      <types>BusinessProcessRef.CRM_БизнесПроцесс</types>
      <types>DocumentRef.УдалитьCRM_Сделка</types>
      <types>DocumentRef.КоммерческоеПредложениеКлиенту</types>
      <types>DocumentRef.УдалитьCRM_Событие</types>
      <types>DocumentRef.CRM_СообщениеМессенджера</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Избранный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <comment>Контактное лицо</comment>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемаяВыручка</name>
    <comment>Ожидаемая выручка</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <comment>Описание</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Организация</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>Ответственный</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Офис</name>
    <comment>Офис подразделения</comment>
    <type>
      <types>CatalogRef.CRM_ОфисыКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <comment>Клиент</comment>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>СделкаСКлиентом</name>
    <comment>Только для объединенных решений</comment>
    <type>
      <types>CatalogRef.СделкиСКлиентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <comment>Только для объединенных решений</comment>
    <type>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение ответственного</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПотенциальныйКлиент</name>
    <comment>Потенциальный клиент</comment>
    <type>
      <types>CatalogRef.CRM_ПотенциальныеКлиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказа</name>
    <comment>Причина отказа</comment>
    <type>
      <types>CatalogRef.CRM_ПричиныОтказаПоИнтересам</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеИнтереса</name>
    <comment>Состояние интереса</comment>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <comment>Тема</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипУслуги</name>
    <comment>Тип услуги</comment>
    <type>
      <types>CatalogRef.CRM_ТипУслуги</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СкидкиРассчитаны</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>CRM_Теги</name>
    <attributes>
      <name>Тег</name>
      <type>
        <types>CatalogRef.CRM_Теги</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсталосьОтгрузить</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отгружено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентРучнойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРучнойСкидки</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентАвтоматическойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАвтоматическойСкидки</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураНабора</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНабора</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкидкиНаценки</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаценка</name>
      <type>
        <types>CatalogRef.СкидкиНаценки</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>НапомнитьПозже</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тестовая_база_ERP_14/src/CommonModules/CRM_СобытияФорм/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Содержит события форм, вызываемые на сервере
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//  Форма					 - УправляемаяФорма	 - форма, из обработчика события которой происходит вызов процедуры.
//  Отказ					 - Булево			 - признак отказа от создания формы.
//  СтандартнаяОбработка	 - Булево			 - признак выполнения стандартной (системной) обработки события
//  ДополнительныеПараметры	 - Структура		 - дополнительные параметры.
//
Функция ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры = Неопределено) Экспорт

	// +Рабочий стол
	СписокДоступныхФормРабочегоСтола = CRM_РабочийСтолСервер.ПолучитьСписокДоступныхФорм();
	
	Если СписокДоступныхФормРабочегоСтола.НайтиПоЗначению(Форма.ИмяФормы) <> Неопределено Тогда
		CRM_РабочийСтолСервер.ПриСозданииНаСервере(Форма, Отказ);
	КонецЕсли;
	// -Рабочий стол
	
	// +Доступные пользователи
	УстановитьОграниченияПоПользователям(Форма);
	// -Доступные пользователи
	
	Кнопка = Форма.Элементы.Найти("ФормаОбщаяКомандаНапомнить");
	
	Если Кнопка <> Неопределено Тогда
		
		Кнопка.Видимость = Ложь;
		
	КонецЕсли;
	
	Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		Группа = Форма.Элементы.Найти("ГруппаКомманднаяПанельПодменюОтчетыСмТакже");
		Если Группа <> Неопределено Тогда
			Группа.Видимость = Ложь;
		КонецЕсли;
		Группа = Форма.Элементы.Найти("ПодменюОтчетыСмТакже");
		Если Группа <> Неопределено Тогда
			Группа.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		Форма_Объект = Форма.Объект;
		Если НЕ ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.CRM_Интерес") Тогда
			Если CRM_БизнесПроцессыСервер.ОбъектСвязанСБизнесПроцессом(Форма.Объект.Ссылка) Тогда
				CRM_БизнесПроцессыСервер.ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
			КонецЕсли;
		КонецЕсли;
		CRM_ТригерыСервер.ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
	Исключение
	КонецПопытки;
	
	Если НЕ CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		
		Если Форма.ИмяФормы = "Документ.CRM_Интерес.Форма.ФормаДокумента" Тогда
			Если Метаданные.Документы.CRM_Интерес.Реквизиты.Найти("Соглашение") <> Неопределено Тогда
				Документы.CRM_Интерес.Модуль_СоздатьЭлементыФормы(Форма);
			КонецЕсли;
		
		ИначеЕсли Форма.ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаДокумента" Тогда
			
			Если CRM_ОбщегоНазначенияСервер.НайтиВМетаданныхПоИмени("ОбщиеМодули", "CRM_Модуль_РаботаСФормамиСервер") Тогда
				МодульРаботаСФормамиСервер = ОбщегоНазначения.ОбщийМодуль("CRM_Модуль_РаботаСФормамиСервер");
				МодульРаботаСФормамиСервер.СоздатьНеобходимыеРеквизитыИЭлементыДляГруппыИнтерес(Форма);
			КонецЕсли;
			
		ИначеЕсли Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента" Тогда
			CRM_КлассификаторыВызовСервера.ДобавитьЗакладкуКлассификацияВТиповуюФорму(Форма);
			/// Классификаторы
			Форма.Элементы.ГруппаКлассификация.Видимость = ПолучитьФункциональнуюОпцию("CRM_ИспользоватьКлассификаторы");
		КонецЕсли;
		
		Если Форма.Параметры.Свойство("ПолучитьИмяРеквизитаСписка") Тогда
			
			// найдем реквизит списка
			
			МассивРеквизитыФормы = Форма.ПолучитьРеквизиты();
			
			ИмяРеквизитаСписка = "";
			
			ИмяПервогоДинамическогоСписка = "";
			
			Для Каждого РеквизитФормы Из МассивРеквизитыФормы Цикл
				
				// проверим, является ли реквизит динамическим списком
				
				МассивТипов = РеквизитФормы.ТипЗначения.Типы();
				
				Для Каждого ТипРеквизита Из МассивТипов Цикл
					
					Если ТипРеквизита = Тип("ДинамическийСписок") Тогда
						
						Если ПустаяСтрока(ИмяПервогоДинамическогоСписка) Тогда
							
							ИмяПервогоДинамическогоСписка = РеквизитФормы.Имя;
							
						КонецЕсли;
							
						Если Найти(РеквизитФормы.Имя, "Список") > 0 Тогда
							
							ИмяРеквизитаСписка = РеквизитФормы.Имя;
							
							Прервать;
							
						КонецЕсли;
					
					КонецЕсли;
					
				КонецЦикла;
					
				Если Не ПустаяСтрока(ИмяРеквизитаСписка) Тогда
					
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если ПустаяСтрока(ИмяРеквизитаСписка) Тогда
				
				ИмяРеквизитаСписка = ИмяПервогоДинамическогоСписка;
				
			КонецЕсли;	
			
			// добавим реквизит для обмена с формами выбора документов
			
			ДобавляемыеРеквизиты = Новый Массив; 
			Реквизит = Новый РеквизитФормы("ИмяРеквизитаСписка", Новый ОписаниеТипов("Строка")); 
			ДобавляемыеРеквизиты.Добавить(Реквизит); 
			Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
			
			Если НЕ ПустаяСтрока(ИмяРеквизитаСписка) Тогда
				
				Форма["ИмяРеквизитаСписка"] = ИмяРеквизитаСписка;
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	CRM_МодификацияКонфигурацииПереопределяемый.ПриСозданииНаСервере(Форма.ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	Возврат Истина;
КонецФункции

// Процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//	Форма					- УправляемаяФорма - форма, из обработчика события которой происходит вызов процедуры.
//	ТекущийОбъект			- Объект - объект, который будет прочитан.
//	ДополнительныеПараметры - Структура - дополнительные параметры.
//
Процедура ПриЧтенииНаСервере(Форма, ТекущийОбъект, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если НЕ CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		Если Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента" Тогда
			CRM_КлассификаторыВызовСервера.ФормаОбъектаПриЧтенииНаСервере(Форма, Форма.Объект.Ссылка);
		КонецЕсли;
	КонецЕсли;
	
	CRM_МодификацияКонфигурацииПереопределяемый.ПриЧтенииНаСервере(Форма, ТекущийОбъект);
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
// 	Форма - УправляемаяФорма - Форма, из обработчика события которой происходит вызов процедуры.
//  Отказ			 - Булево - Отказ.
//  ТекущийОбъект	 - ЛюбойТип - Текущий объект.
//  ПараметрыЗаписи	 - Структура - Параметры записи.
//
Процедура ПередЗаписьюНаСервере(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи)Экспорт
	
	Попытка
		Форма_Объект = Форма.Объект;
		Если НЕ ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.CRM_Интерес") Тогда
			Если CRM_БизнесПроцессыСервер.ОбъектСвязанСБизнесПроцессом(Форма.Объект.Ссылка) Тогда
				CRM_БизнесПроцессыСервер.ПередЗаписьюНаСервере(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
			КонецЕсли;
		КонецЕсли;
		CRM_ТригерыСервер.ПередЗаписьюНаСервере(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	Исключение
	КонецПопытки;
	
	Если Форма.ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаДокумента" Тогда
		Если CRM_ОбщегоНазначенияСервер.НайтиВМетаданныхПоИмени("ОбщиеМодули", "CRM_Модуль_РаботаСФормамиСервер") Тогда
			МодульРаботаСФормамиСервер = ОбщегоНазначения.ОбщийМодуль("CRM_Модуль_РаботаСФормамиСервер");
			МодульРаботаСФормамиСервер.ПередЗаписьюНаСервере(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
		КонецЕсли;
	КонецЕсли;
	
	CRM_МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
// 	Форма - УправляемаяФорма - Форма, из обработчика события которой происходит вызов процедуры.
//  ТекущийОбъект	 - ЛюбойТип - Текущий объект.
//  ПараметрыЗаписи	 - Структура - Параметры записи.
//
Процедура ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи)Экспорт
	
	Попытка
		Форма_Объект = Форма.Объект;
		Если НЕ ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.CRM_Интерес") Тогда
			Если CRM_БизнесПроцессыСервер.ОбъектСвязанСБизнесПроцессом(Форма.Объект.Ссылка) Тогда
				CRM_БизнесПроцессыСервер.ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи);
			КонецЕсли;
		КонецЕсли;
		CRM_ТригерыСервер.ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи);
	Исключение
	КонецПопытки;
	
	CRM_МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

#КонецОбласти
